project/app/Controllers/Index.php

    public function resetpassword(){
        if($this->request->is('POST')){
            // Load model
            $usersmodel = model('Users_model');
            // Retrieve data from form
            $userreset = $this->request->getPost(['username']);
            // Set filter then query from tblusers
            $user  = $usersmodel->where('username', $userreset['username'])->first();
---
SELECT *
FROM `users`
WHERE `username` = '2222'
 LIMIT 1