project/app/Controllers/Index.php

SELECT *
FROM `users`
WHERE `username` = '202400007'
AND `password` = '123123123'
 LIMIT 1
---
    public function login(){
        if(session()->has('isLogged')){
            if(session()->get('role') == 'itso'){
                return redirect()->to('welcomeitso');
            } else if(session()->get('role') == 'associate'){
                return redirect()->to('welcomeassociate');
            } else if(session()->get('role') == 'student'){
                return redirect()->to('welcomestudent');
            }
        }


        if($this->request->is('POST')){
            // Load model
            $usersmodel = model('Users_model');
            // Retrieve data from form
            $userreset = $this->request->getPost(['username', 'password']);
            // Set filter then query from tblusers
            $user  = $usersmodel->where('username', $userreset['username'])
                ->where('password', $userreset['password'])
                ->first();