project/app/Controllers/Users.php

SELECT *
FROM `users`
 LIMIT 2
---
    public function index(){

        $usersmodel = model('Users_model');

        //$data['users'] = $usersmodel->get()->getResult();
        $data['users'] = $usersmodel->paginate(2); //increase this if not testing