project/app/Controllers/Users.php

    public function add(){
        helper('form');

        if($this->request->is('POST')){

            $usersmodel = model('Users_model');

            $registerdata = $this->request->getPost([
                'name',
                'birthdate',
                'role',
                'email',
            ]);

            //generate username format YYYY00001
            $lastUser = $usersmodel->orderBy('id', 'DESC')->first();
            $lastId = $lastUser ? $lastUser['id'] : 0;
            $newId = str_pad($lastId + 1, 5, '0', STR_PAD_LEFT);
            $registerdata['username'] = date('Y') . $newId;

            //generate password from birthdate as default
            $defaultpass = $this->request->getPost([
                'birthdate'
            ]);
            $registerdata['password'] = $defaultpass['birthdate'];

            $registerdata['activationcode'] = uniqid();

            $usersmodel->insert($registerdata);
---
SELECT *
FROM `users`
ORDER BY `id` DESC
 LIMIT 1
INSERT INTO `users` (`name`, `birthdate`, `role`, `email`, `username`, `password`) VALUES ('Malvin', '2024-11-26', 'itso', 'xarex61342@exoular.com', '202400001', '2024-11-26')