project/app/Controllers/Users.php

SELECT *
FROM `users`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function index(){
        if(session()->has('isLogged')){
            if(!session()->get('role') == 'itso'){
                return redirect()->to('logout');
            }
        } else {
            return redirect()->to('login');
        }

        $usersmodel = model('Users_model');

        //$data['users'] = $usersmodel->get()->getResult();
        $data['users'] = $usersmodel->paginate(10); //increase this if not testing